{
    "@context": "http://schema.org",
    "@type": "Restaurant",
    "image": [
        "",
        ""
    ],
    "name": "Nutri Nuts Kitchen",
    "address": "3480 Moncton St, Richmond, BC V7E 3A2, Canada",
    "geo": {
        "@type": "GeoCoordinates",
        "latitude": "49.12497",
        "longitude": "-123.18492"
    },
    "priceRange": "$$",
    "hasMenu": {
        "@type": "Menu",
        "hasMenuSection": [
            [
                {
                    "name": "Afternoon Vibe",
                    "hasMenuItem": [
                        {
                            "@type": "MenuItem",
                            "name": "Authentic Tea Party",
                            "description": "Satisfy your sweet tooth with our Afternoon Tea set, featuring a pot of tea, a heavenly Chocolate Cake, a delicious French Macaron, and a zesty Lemon Meringue Tart. Our last call for Afternoon Tea is at 5:30 pm.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Luxurious Afternoon Tea",
                            "description": "End your meal on a sweet note with a choice of delectable desserts including French Macaron, Chocolate Cake, Lemon Meringue Tart, Scones, and Sultana Cranberry Scone with Wild Strawberry Jam &amp; Cream.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$85.80"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Family Tea Party",
                            "description": "Satisfy your sweet cravings with our delicious desserts including French Macaron, Chocolate Cake, Lemon Meringue Tart, Vanilla Cupcake, and Sultana Cranberry Scone with Cream and Jam.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$108.90"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Tea Lover&apos;s Set",
                            "description": "Elevate your afternoon tea experience with a divine selection of treats. Indulge in a delightful pot of tea accompanied by a freshly baked scone, decadent chocolate cake, exquisite French macaron, tangy lemon meringue tart, flavorful free-range egg stuffed croissant, and refreshing cucumber dill sandwich. The last call for afternoon tea is at 5:30 pm.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$32.99"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Kiddie Tea Party",
                            "description": "Discover the range of savouries we have to offer, from Ham Cheese Sandwich to Strawberry Jam Sandwich, along with our array of sweets such as Fruit Tart, French Macaron, Chocolate Cake, and Vanilla Cupcake. Stay refreshed with our selection of drinks, including Juice Box and Slush Puppie. Our last call for Afternoon Tea is at 5:30 pm.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$28.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Grand Afternoon Tea",
                            "description": "Our delectable selection of savouries includes Roasted Organic Chicken with Cranberry Red Onion on Cone, Free Range Egg &amp; Sweet Pickle Stuffed Croissant, Smoked Salmon, Black Truffle on Pumpernickel Bread, Cucumber, Dill &amp; Cream Cheese Sandwich, Turkey, Roasted Red Pepper &amp; Cranberry Sandwich, and Prawn, Avocado &amp; Salmon Roe with Basil Mayonnaise. And for dessert, indulge in our sweet delicacies inspired by the season, such as French Macaron, Chocolate Cake, Lemon Meringue Tart, Scones, and Sultana Cranberry Scone with Wild Strawberry Jam &amp; Cream. You can also enjoy a pot of tea with a selection from our Collection of Green and Black Teas. Our last call for Afternoon Tea is at 5:30 pm.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$50.60"
                            },
                            "image": ""
                        }
                    ]
                },
                {
                    "name": "Breakfast Delights",
                    "hasMenuItem": [
                        {
                            "@type": "MenuItem",
                            "name": "Mozzarella Melody Bruschetta",
                            "description": "Enjoy the perfect blend of juicy tomatoes, velvety mozzarella, and zesty pesto sauce on toasted sourdough bread, accompanied by a fresh green salad. Conclude your meal with a delectable lemon meringue tart and a warm cup of tea.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$16.49"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Caprese Symphony Panini",
                            "description": "Enjoy the scrumptious combination of tangy tomatoes, smooth mozzarella, and aromatic pesto sauce on a slice of freshly-baked sourdough bread, alongside a crisp green salad. Wrap up your dining experience with a delectable lemon meringue tart and a comforting cup of tea.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$16.49"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Sweet and Savory Panini Plate",
                            "description": "Enjoy the delicious combination of tender turkey, sweet cranberry, flavorful Swiss cheese, and rich provolone cheese on a slice of toasted sourdough bread, topped with pesto sauce and roasted peppers, and served with a fresh green salad. Conclude your meal with a tart lemon meringue and a steaming cup of tea.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$18.69"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Mixed Seafood Toast",
                            "description": "For a savory lunch, try our smoked salmon, prawn, cream cheese, and horseradish sandwich on sourdough bread, served with a side of green salad, a delightful lemon meringue tart, and a cup of tea. Please keep in mind that the menu is subject to changes and the store has the final say in interpretation.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$21.99"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Lobster Crostini",
                            "description": "Elevate your culinary experience with the exquisite flavors of Grilled Lobster Tail, Avocado, Smoked Salmon, Prawn, Tomato, and Horseradish, generously heaped onto a slice of perfectly toasted Sourdough Bread. The dish comes paired with a light and refreshing green salad, adding a healthy twist to your meal. End your feast on a sweet note with the tangy Lemon Meringue Tart and a warm cup of tea.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$32.99"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Italian Meat Panini",
                            "description": "Delight your taste buds with the flavorful blend of Prosciutto, Salami, Swiss Cheese, Provolone, and Tomato, served on freshly baked Sourdough Bread, accompanied by a light and refreshing green salad. The meal is topped off with the indulgent Lemon Meringue Tart and a warm cup of tea, providing the perfect balance of sweet and savory.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$18.69"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Seafood Melody Sandwich",
                            "description": "Treat yourself to a scrumptious meal with our Smoked Salmon, Prawn, Cream cheese, and Horseradish on White Bread, paired with a refreshing green salad. Cap off your meal with One Lemon Meringue Tart and a steaming cup of tea.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$20.89"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Ocean Breeze Cranberry Turkey Panini",
                            "description": "For a satisfying lunch, try our turkey, cranberry, Swiss cheese, provolone, pesto, and roasted pepper sandwich on sourdough bread, served with a refreshing seafood salad, a delectable lemon meringue tart, and a cup of tea. Please keep in mind that the menu is subject to changes and the store has the final say in interpretation.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$32.99"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Luxe Lobster Bruschetta",
                            "description": "For a decadent lunch, try our grilled lobster tail, avocado, smoked salmon, prawn, tomato, and horseradish sandwich on sourdough bread, served with a side of green salad, a luscious lemon meringue tart, and a cup of tea. Please keep in mind that the menu is subject to changes and the store has the final say in interpretation.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$43.99"
                            },
                            "image": ""
                        }
                    ]
                },
                {
                    "name": "Snack Vibe",
                    "hasMenuItem": [
                        {
                            "@type": "MenuItem",
                            "name": "Chocolate Mousse Delight",
                            "description": "A smooth and creamy chocolate mousse, typically garnished with whipped cream and chocolate shavings.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$4.39"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Garden Fresh Creamy Sandwich",
                            "description": "Creamy spread paired with a selection of garden-fresh vegetables such as lettuce, tomatoes, cucumbers, and carrots on whole grain bread.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$5.23"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Parisian Petit Macaron",
                            "description": "Petite and elegant, our Parisian petit macaron combines a delicate almond shell with a smooth, sweet filling, embodying the essence of traditional French patisserie.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$4.39"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Prawn Basil Bites",
                            "description": "Fried shrimp infused with basil, typically served as a light, crispy snack.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$10.84"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Cream Tea Scone",
                            "description": "A cream tea scone is a freshly baked scone typically served with clotted cream and jam, often accompanied by a pot of tea.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$3.03"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Tuna Steak Salad",
                            "description": "Seared tuna steak served atop a bed of mixed greens, typically includes tomatoes, cucumbers, and a light dressing.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$19.79"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Truffle Pumpernickel Spread",
                            "description": "Pumpernickel bread spread with a rich truffle-infused cream, typically includes a blend of aromatic herbs.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.33"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Wild Strawberry Treat",
                            "description": "Wild strawberries paired with a light, sweet cream, typically garnished with a sprinkle of powdered sugar.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$5.23"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Mini Swiss Turkey Slider",
                            "description": "Ground turkey patty with Swiss cheese on a small bun, typically includes lettuce, tomato, and mayo.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.33"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Grilled Sea Lobster",
                            "description": "Grilled sea lobster, typically served with a light seasoning to enhance its natural flavors.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$23.09"
                            },
                            "image": ""
                        }
                    ]
                },
                {
                    "name": "Nutrinuts Special",
                    "hasMenuItem": [
                        {
                            "@type": "MenuItem",
                            "name": "Healthy - Almonds - Lime and Pepper",
                            "description": "Our premium almonds are brought raw and roasted in-store daily by our expert chefs, who add a zesty twist with tangy lime and aromatic black pepper.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Nutritious Almonds-lime and Saffron",
                            "description": "Roasted almonds infused with tangy lime juice and fragrant saffron, offering a delectable flavor profile.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Raw Almonds",
                            "description": "Crunchy, plump, and organic raw almonds with a delightful nutty-sweet taste.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Smoked Almonds",
                            "description": "Savor the hot and steamy smoked finish of our freshly roasted almonds, made to perfection.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Raw Brazil Nuts",
                            "description": "These large, oil-rich nuts are a beloved choice for promoting health and longevity, as they contain ample amounts of selenium.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Curry Cashews",
                            "description": "Enjoy the velvety, premium, naturally sweet flavor of hand-roasted cashews, perfectly seasoned with warm Indian masala curry spices.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Greek Cashews",
                            "description": "Savour the rich, premium taste of cashews, expertly roasted with fragrant herbs from the Mediterranean.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Raw Cashews (Organic)",
                            "description": "Our organic raw cashews are the perfect addition to your healthy diet, with their creamy texture and high protein content.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Seasoned Roasted Cashews",
                            "description": "Enjoy the natural richness of our premium cashews, perfectly roasted and seasoned with just the right amount of salt.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Spicy Cashews",
                            "description": "Chef Ayoub&apos;s traditional methods of roasting cashews with hot and spicy seasonings bring out a creamy texture and rich taste that will leave you wanting more.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Za&apos;atar Blend Cashews",
                            "description": "Experience the rich and bold flavors of the Levant with these expertly roasted cashews.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Healthy Glazed Cashew",
                            "description": "Indulge in our sweet and nutty roasted cashews, glazed with brown sugar and a hint of vanilla to satisfy your cravings.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Lightly Salted Hazelnuts",
                            "description": "Straight from Oregon, our premium hazelnuts are salted and roasted to perfection by our expert chefs in-store for maximum freshness.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Raw Hazelnuts",
                            "description": "Renowned for their role in European desserts and as a crucial ingredient in a popular chocolate spread, our hazelnuts are of the highest quality and perfect for all your baking needs.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Lime and Pepper Kernel Mix",
                            "description": "Our zesty mix of lime juice and aromatic cracked black pepper creates a perfect combination of flavors in these cashews! Ideal for entertaining, game day, and healthy lunches.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Spicy Kernel Mix",
                            "description": "Indulge in a delicious and healthy snack by trying our freshly-roasted cashews in-store! Perfect for lunches, entertaining, gifts, and as a lightweight protein for athletic activities.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Owning Your Health - Light Salt Cashews",
                            "description": "Enjoy the creamy texture and mild saltiness of our premium roasted cashews- a perfect snack for any time of day!",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Healthy Light Salt Peanuts",
                            "description": "We carefully sprinkle our pistachios with salt to enhance their natural texture and flavor, just as our customers have come to expect.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Owning Your Health - Light Salt Premium Pistachios",
                            "description": "We&apos;ve been working with a group of small-scale producers since the early 1980s to source the highest quality pistachios for our customers.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Lime and Saffron Cashews Nutrinuts",
                            "description": "Our pistachios are roasted to perfection with a zesty lime kick and delicate floral saffron notes.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Lime and Saffron Pistachios",
                            "description": "Tangy lime juice and aromatic saffron impart their flavors to the tender roasted pistachios.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Raw Macadamia Nuts",
                            "description": "Macadamia nuts are rich in healthy micronutrients, minerals, antioxidants, and vitamins, and their soft and oily texture melts in your mouth.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Lightly Salted Peanuts (Blanched)",
                            "description": "These peanuts are bursting with flavor and will be your go-to snack for movie nights, games, or whenever you need a quick energy boost during the day.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Lime and Pepper Peanuts",
                            "description": "For those who want a flavorful and energizing snack, these peanuts are the perfect choice for movie nights, games, and any time of day.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Salted Peanuts",
                            "description": "Pecans, a highly popular nut, are a nutritious snack and commonly used in baking.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Raw Pecans",
                            "description": "Pecans are a popular nut that&apos;s often consumed as a healthy snack and used as an ingredient in baked goods.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Raw Premium Pistachios",
                            "description": "Since the early 1980s, we&apos;ve been sourcing quality pistachios from small producers in the middle east for our customers.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Lime and Saffron Round Pistachios",
                            "description": "Our premium pistachios are expertly roasted with tangy lime juice and floral aromatic saffron for a delightful taste.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Raw Almonds-sliced",
                            "description": "These naturally sweet and tender raw almonds are perfect for baking, confections, and as a garnish, and are conveniently prepared for any recipe. Use them to add extra protein and crunch to salads or toast them for a more aromatic flavor.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Raw Shelled Premium Pistachios",
                            "description": "Our premium pistachios come without shells, making them the perfect hassle-free snack for any occasion!",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Raw Soft Chickpeas",
                            "description": "Take home our raw chickpeas and roast them to your liking for a delicious and nutritious snack.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Lightly Salted Soft Roasted Chickpeas",
                            "description": "Our imported chickpeas from the middle east are sure to delight your taste buds and leave you wanting more!",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Raw Spanish Almonds (Organic)",
                            "description": "These raw, organic almonds from Spain are nutty-sweet, plump, and crunchy, providing a fresh and wholesome snacking experience.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Raw Walnuts",
                            "description": "Our premium walnuts are sourced from California or chile, depending on the harvest each year. Known for their powerful nutrients, researchers have dubbed walnuts &quot;Remarkable,&quot; but we simply find them delicious.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Owning Your Health - Walnuts - Raw-halves and Pieces (Organic)",
                            "description": "These fresh and crunchy organic English walnut pieces are of high quality and are the perfect addition to your recipes and mixes for an extra delicious crunch.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Raw Cashews",
                            "description": "Raw cashews are a versatile ingredient for vegan and raw food recipes, from nut milk to energy balls and beyond!",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Jamaican Cashews Blend",
                            "description": "Caribbean spices infuse these cashews with a robust and spicy flavor that is sure to excite your taste buds.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.59"
                            },
                            "image": ""
                        }
                    ]
                }
            ]
        ]
    },
    "servesCuisine": [
        "Breakfast",
        "Snacks",
        "Ice Cream"
    ],
    "url": "https://www.doordash.com/store/nutri-nuts-kitchen-richmond-24935019/?cursor=eyJzZWFyY2hfaXRlbV9jYXJvdXNlbF9jdXJzb3IiOnsicXVlcnkiOiJyZXN0YXVyYW50cyIsIml0ZW1faWRzIjpbXSwic2VhcmNoX3Rlcm0iOiJyZXN0YXVyYW50IiwidmVydGljYWxfaWQiOi05OSwidmVydGljYWxfbmFtZSI6IiJ9LCJzdG9yZV9wcmltYXJ5X3ZlcnRpY2FsX2lkcyI6WzEsNF19&pickup=false",
    "phone": "6045152777",
    "doordashOperationHourInfo": {
        "MONDAY": [
            "11:30 AM - 5:40 PM"
        ],
        "TUESDAY": [
            "11:30 AM - 5:40 PM"
        ],
        "WEDNESDAY": [
            "11:30 AM - 5:40 PM"
        ],
        "THURSDAY": [
            "11:30 AM - 5:40 PM"
        ],
        "FRIDAY": [
            "11:30 AM - 5:40 PM"
        ],
        "SATURDAY": [
            "11:30 AM - 5:40 PM"
        ],
        "SUNDAY": [
            "11:30 AM - 5:40 PM"
        ]
    },
    "storeOperationHourInfo": {
        "MONDAY": [
            "11:30 AM - 6 PM"
        ],
        "TUESDAY": [
            "11:30 AM - 6 PM"
        ],
        "WEDNESDAY": [
            "11:30 AM - 6 PM"
        ],
        "THURSDAY": [
            "11:30 AM - 6 PM"
        ],
        "FRIDAY": [
            "11:30 AM - 6 PM"
        ],
        "SATURDAY": [
            "11:30 AM - 6 PM"
        ],
        "SUNDAY": [
            "11:30 AM - 6 PM"
        ]
    },
    "merchant_cuisine": "Not found"
}