{
    "@context": "http://schema.org",
    "@type": "Restaurant",
    "image": [
        "https://img.cdn4dd.com/cdn-cgi/image/fit=contain,width=1200,height=672,format=auto/https://doordash-static.s3.amazonaws.com/media/restaurant/cover/f251ad47-7596-49af-a1a2-e205515eaf37.png",
        "https://img.cdn4dd.com/cdn-cgi/image/fit=contain,width=1200,height=672,format=auto/https://doordash-static.s3.amazonaws.com/media/store/header/a2fe7f60-ffe6-4061-a280-e2c1ff543d89.jpeg"
    ],
    "name": "BAK&apos;D Cookies",
    "address": "285 Nelson'S Crt, New Westminster BC V3L 0E3, Canada",
    "geo": {
        "@type": "GeoCoordinates",
        "latitude": "49.22484",
        "longitude": "-122.89192"
    },
    "priceRange": "$$",
    "hasMenu": {
        "@type": "Menu",
        "hasMenuSection": [
            [
                {
                    "name": "Most Ordered",
                    "hasMenuItem": [
                        {
                            "@type": "MenuItem",
                            "name": "OG",
                            "description": "Indulge in the very first cookie we ever created. Crafted with two types of premium dark chocolate, each bite offers a deep, rich cocoa experience that’s perfectly complemented by the satisfying crunch of toasted walnuts. To elevate the flavors even further, we’ve topped this cookie with a sprinkle of flaky sea salt, adding a touch of savory balance to the bittersweet chocolate and buttery walnuts. This cookie is an irresistible treat for those who crave a truly decadent dessert.\n\nIngredients: butter, brown sugar, white sugar, eggs, flour, baking soda, salt, cornstarch, walnuts, choco chunks, and choc wafers.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.61"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Gimme S&apos;mores",
                            "description": "Our best seller! The best part of camping, all in one cookie. The gimme s&apos;mores cookie has everyone dreaming of their favourite childhood memory of roasting marshmallows over the campfire and making the perfect s’mores. This cookie is with made with our signature cookie base and stuffed with marshmallows, dark chocolate chunks, and graham crackers for the perfect bite. Ingredients: brown sugar, all purpose flour, cake flour, butter, white sugar, cream cheese, eggs, graham crackers, marshmallows, dark chocolate chunks, baking soda, cornstarch, and salt.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.61"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "(V) Biscoff Cookie Butter",
                            "description": "Indulge in this decadent, plant-based treat crafted from a perfectly spiced cookie dough infused with crushed Lotus Biscoff cookies. Each bite unveils a rich, gooey center of creamy Biscoff cookie butter, creating a heavenly fusion of flavors. To top it all off, we’ve crowned this cookie with a signature Lotus Biscoff, adding an extra layer of crunch and caramelized sweetness. A true delight for Biscoff lovers and cookie connoisseurs alike!",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.90"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Cookies &amp; Cream",
                            "description": "Milk&apos;s favourite cookie, in a cookie. The cookies n cream cookie has all of the best parts of the Oreo made even better with our signature cookie dough. With house-made Oreo wafers and white chocolate folded into the dough, we drizzle more white chocolate on top because the middle of the Oreo is definitely the best part. \n\nIngredients: brown sugar, all purpose flour, cake flour, butter, white sugar, cream cheese, eggs, cocoa powder, white chocolate wafers, milk, baking soda, cornstarch, and salt.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.61"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Chocolatey PB",
                            "description": "Peanut butter and chocolate, a match made in heaven. The chocolatey pb is the best of both worlds with our signature chocolate cookie dough base loaded with Reese’s peanut butter chips mixed in for peanut butter flavour throughout. For even more peanut butter goodness, we also stuff each cookie dough ball with a spoonful of peanut butter for an ooey-gooey center. This is one of our best selling cookies and we definitely recommend it if you’re a fan of peanut butter. Even NDP leader Jagmeet Singh is a huge fan of this cookie! Ingredients: all purpose flour, butter, cake flour, brown sugar, white sugar, eggs, peanut butter, peanut butter chips, cocoa powder, baking soda, corn starch, and salt.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.61"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Birthday Cake",
                            "description": "It&apos;s always a celebration with this cookie. The birthday cake cookie is our take on the funfetti birthday cake flavour that everyone knows and loves. With hints of vanilla, lots of colorful sprinkles, and a bit of crunch from bite sized pieces of animal crackers, every bite has the perfect texture and flavour that anyone of all ages will enjoy. The birthday cake cookie is also perfectly for celebrations too! Just warm up the cookie following our heating instructions which you can find and put a candle in it! You can even put a scoop of vanilla ice cream next to it for the perfect dessert. Ingredients: brown sugar, all purpose flour, cake flour, butter, white sugar, cream cheese, eggs, animal crackers, vanilla extract, sprinkles, baking soda, cornstarch, and salt.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.61"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Iced Strawberry Matcha Latte",
                            "description": "Discover our best-selling Iced Strawberry Matcha, a delightful fusion of vibrant green matcha and luscious strawberry puree at the bottom. Hand-whisked to order and made with organic ceremonial grade matcha from Japan, this refreshing drink offers a perfect blend of earthy matcha flavors and sweet, juicy strawberries.\n\nIt&apos;s a refreshing, Instagram-worthy treat that’s as delicious as it is beautiful!",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$7.94"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Caramel Macchiato",
                            "description": "Experience your favorite coffeehouse treat in cookie form! Our Caramel Macchiato Cookie is crafted with a rich espresso-infused dough, perfectly balanced with swirls of velvety caramel. Every bite delivers the bold flavor of freshly brewed coffee, complemented by sweet, buttery caramel notes. Finished with a drizzle of caramel on top, this cookie is the perfect pick-me-up for coffee lovers and anyone craving a sweet, caffeinated treat.\n\nNote: contains real coffee. \n\nIngredients: butter, sugar, eggs, coffee, flour, baking soda, salt, corn starch, and butter starch.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.61"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Matcha Latte",
                            "description": "Savor the earthy elegance of our Matcha Dream Cookie, made with premium matcha powder that gives each bite a vibrant green hue and a distinct, delicate flavor. The soft, chewy texture is perfectly balanced by the subtle sweetness that lets the rich, grassy notes of matcha shine through. Finished with a drizzle of white chocolate, this cookie is a must-try for matcha lovers and anyone seeking a refined, flavorful treat.\n\nIngredients: butter, sugar, eggs, matcha, flour, baking soda, salt, cornstarch, and white choc chips.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.61"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Box of 4 Cookies ",
                            "description": "Choose 4 cookie flavours for your cookie box. ",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$26.40"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Box of 6 Cookies",
                            "description": "Choose 6 flavours for your cookie box. ",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$37.20"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Box of 10 Cookies",
                            "description": "Choose 10 cookie flavours to go inside your cookie box! ",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$57.00"
                            },
                            "image": ""
                        }
                    ]
                },
                {
                    "name": "POPULAR DRINKS - I&apos;M A LITTLE SPECIAL ",
                    "hasMenuItem": [
                        {
                            "@type": "MenuItem",
                            "name": "Iced BAK&apos;D Cookie Latte",
                            "description": "Enjoy a refreshing twist on a cozy classic with our Iced BAK&apos;D Cookie Latte. This drink features two shots of rich espresso expertly blended with your choice of milk and our secret syrup that perfectly captures the sweet, buttery taste of a sugar cookie. Poured over ice for a cool, invigorating treat, it&apos;s finished with festive sprinkles and crunchy cookie crumbs, adding delightful texture and flavor to every sip. Whether you&apos;re craving a sweet pick-me-up or just a little taste of nostalgia, this iced latte is sure to satisfy.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$8.28"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Salted Caramel Latte",
                            "description": "Dive into our Salted Caramel Latte—a smooth sea of espresso and creamy caramel, crowned with a whirl of caramel drizzle and a sprinkle of Maldon&apos;s flaky sea salt. It&apos;s like a sweet and salty symphony in every sip, where indulgence meets a touch of seaside magic. Savor the swirls and let your taste buds ride the caramel wave!",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$7.76"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Iced Viet Coffee (3 oz)",
                            "description": "Experience the bold flavors of Vietnam with our Iced Vietnamese Coffee. This refreshing drink features two shots of robust espresso poured over sweetened condensed milk, complemented by a splash of milk for a creamy texture. Served over ice, it delivers a harmonious blend of strong coffee and sweet, indulgent flavors that&apos;s perfect for a refreshing pick-me-up.\n\nCan be topped off with milk to make it less strong!",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.61"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Pumpkin Spice Latte",
                            "description": "Our take on the classic pumpkin spice latte with a housemade pumpkin spice whip cream and cinnamon topping. ",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$7.56"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Strawberry Lemonade",
                            "description": "Quench your thirst with our Strawberry Lemonade—a burst of sunshine in every sip! Imagine ripe, juicy strawberries and tangy lemon juice mingling together in a refreshing symphony of flavors. Served over ice, it&apos;s the perfect companion for a sunny day, offering a delightful blend of sweet and sour that&apos;ll keep you coming back for more!",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$5.18"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Dirty Chai",
                            "description": "A Dirty Chai is a bold and flavorful drink that blends the warm spices of traditional chai tea with the robust kick of espresso. It starts with a base of spiced chai, which is a fragrant mix of black tea infused with cinnamon, cardamom, ginger, and other aromatic spices. To this, a shot or two of rich espresso is added, giving the drink a deeper, more intense flavor. The result is a perfect harmony of sweet, spicy, and bitter notes. Whether served hot or iced, a Dirty Chai is a great choice for those who love the warming spices of chai but crave the energy boost of coffee.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$7.19"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Iced Salted Caramel Latte",
                            "description": "Cool off with our irresistible Iced Salted Caramel Latte, where velvety espresso meets the smooth sweetness of salted caramel syrup, all blended with cold milk and poured over ice. Topped with a decadent caramel drizzle and a sprinkle of Maldon flaky sea salt, it&apos;s a delightful combination of rich coffee flavor, creamy texture, and indulgent caramel goodness. Perfect for those who crave a refreshing yet luxurious treat.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$7.94"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Iced Dirty Chai",
                            "description": "An Iced Dirty Chai is the ultimate cool-down with a kick! Imagine the spicy warmth of chai tea—packed with cinnamon, cardamom, and a little zing of ginger—getting a daring upgrade with a shot of bold espresso. Now, imagine all that deliciousness poured over ice and topped with your favorite milk, making each sip a refreshing adventure for your taste buds. It’s like a spicy, sweet, and energizing party in a cup, perfect for those moments when you need to chill out and wake up at the same time!",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$7.68"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Iced Lemonade Matcha",
                            "description": "Refresh your day with our Matcha Lemonade—a zesty fusion of earthy matcha green tea and tangy lemonade. This invigorating blend offers the perfect balance of bold and bright, creating a vibrant and energizing drink that&apos;s as delightful as a sunny day. Sip your way to a burst of green goodness and citrusy cheer!",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$5.75"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Iced Pumpkin Spice",
                            "description": "Iced Pumpkin Spice Latte with a housemade pumpkin spice cold foam on top. ",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$7.76"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Peppermint White Mocha",
                            "description": "",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$7.76"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Iced Peppermint White Mocha",
                            "description": "",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$7.94"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Cinnamon Dolce Latte",
                            "description": "",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$7.76"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Iced Cinnamon Dolce Latte",
                            "description": "",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$7.95"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Iced Strawberry Matcha Latte",
                            "description": "Discover our best-selling Iced Strawberry Matcha, a delightful fusion of vibrant green matcha and luscious strawberry puree at the bottom. Hand-whisked to order and made with organic ceremonial grade matcha from Japan, this refreshing drink offers a perfect blend of earthy matcha flavors and sweet, juicy strawberries.\n\nIt&apos;s a refreshing, Instagram-worthy treat that’s as delicious as it is beautiful!",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$7.94"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "BAK&apos;D Cookie Latte",
                            "description": "Indulge in two shots of rich espresso combined with your choice of milk and our secret syrup that perfectly captures the taste of a sugar cookie. Topped with festive sprinkles and crunchy cookie crumbs, this latte offers delightful texture and flavor in every sip.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$7.76"
                            },
                            "image": ""
                        }
                    ]
                },
                {
                    "name": "DRINKS - ICE ICE BABY ",
                    "hasMenuItem": [
                        {
                            "@type": "MenuItem",
                            "name": "Milk",
                            "description": "Experience the difference with Avalon Milk—crafted with care from local, pasture-raised cows. Rich, creamy, and packed with goodness, it’s the perfect choice for your favorite recipes or a simple, refreshing glass. Taste the tradition of quality in every sip! 🥛",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$4.08"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Iced Hot Choccy ",
                            "description": "\nAn iced hot chocolate is a chilled version of the traditional hot chocolate, offering a rich and creamy experience with a refreshing twist. It starts with a blend of high-quality cocoa powder or melted chocolate, mixed with milk to create a smooth, velvety base. This mixture is then chilled and poured over ice, resulting in a cold, indulgent drink. Often topped with a swirl of whipped cream and a dusting of cocoa or chocolate shavings, it provides a perfect balance of sweetness and a cool, satisfying finish. It&apos;s a great treat for chocolate lovers, especially on a warm day.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$7.36"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Lemonade",
                            "description": "Quench your thirst with our zesty Lemonade, bursting with refreshing lemon flavor and served over ice. It&apos;s a vibrant, tangy treat that&apos;s perfect for brightening up your day, sip by citrusy sip!",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$4.77"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Iced Matcha Latte",
                            "description": "Cool down with our meticulously crafted Iced Matcha, hand-whisked to order for the ultimate freshness. We use only the finest organic ceremonial grade matcha from Japan, ensuring a vibrant green tea experience that&apos;s as authentic as it gets. Each sip offers a harmonious blend of earthy flavors and icy refreshment, making it a true taste of tradition and quality.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$7.07"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Iced Lavendar Matcha",
                            "description": "Step into a garden of flavor with our Lavender Matcha Latte—a whimsical blend where earthy matcha meets the delicate floral notes of lavender. It’s like sipping sunshine through a bouquet, with each creamy sip offering a tranquil escape and a burst of botanical bliss. Embrace the zen and let your taste buds dance!",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$7.65"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Iced Chai Latte",
                            "description": "Enjoy the exotic flavors of our Iced Chai, a refreshing blend of spiced black tea and aromatic spices like cinnamon, cardamom, and ginger. Combined with chilled milk and a touch of sweetness, this invigorating drink offers a perfect balance of creamy texture and spicy notes, perfect for a cool, flavorful escape.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.79"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Iced Mocha",
                            "description": "An iced mocha is a delicious fusion of rich chocolate and bold espresso, served chilled for a refreshing yet indulgent experience. This drink begins with a smooth blend of high-quality cocoa or melted chocolate mixed with milk, creating a creamy base. Two shots of espresso are added to infuse the drink with a robust coffee flavor, perfectly complementing the sweetness of the chocolate. The mixture is then poured over ice, creating a cool, energizing treat. Often topped with a swirl of whipped cream and a sprinkle of cocoa or chocolate shavings, the iced mocha is a delightful choice for anyone who loves the combination of coffee and chocolate.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$8.51"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Iced Latte",
                            "description": "Cool down with our Iced Latte, featuring smooth espresso combined with cold milk over ice. This creamy and refreshing drink offers a perfect balance of rich coffee flavor and chilled, creamy texture, making it a delightful choice for any time of day.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.61"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Iced Americano",
                            "description": "A classic and bold coffee drink made by blending rich espresso shots with hot water, creating a smooth, full-bodied flavor that’s perfect for coffee purists.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$4.54"
                            },
                            "image": ""
                        }
                    ]
                },
                {
                    "name": "DRINKS - HOTTIES",
                    "hasMenuItem": [
                        {
                            "@type": "MenuItem",
                            "name": "Lavender Matcha Latte",
                            "description": "Step into a garden of flavor with our Lavender Matcha Latte—a whimsical blend where earthy matcha meets the delicate floral notes of lavender. It’s like sipping sunshine through a bouquet, with each creamy sip offering a tranquil escape and a burst of botanical bliss. Embrace the zen and let your taste buds dance!",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$7.48"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "The Best Hot Choccy",
                            "description": "Indulge in our decadent Hot Chocolate, made from real, high-quality chocolate melted down to create a rich and creamy drink. Blended with steamed milk, this luxurious treat offers an irresistible, velvety texture and deep chocolate flavor, perfect for warming up on a chilly day.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$7.19"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Matcha Latte",
                            "description": "Discover your matcha made in heaven with our Matcha Latte—a vibrant green elixir that&apos;s as energizing as it is delicious. Imagine a creamy swirl of velvety milk embracing the earthy goodness of matcha, creating a harmonious dance of flavors that&apos;ll make your taste buds sing! Embrace the green revolution and sip your way to blissful zen.\n\nWe proudly hand whisk all matcha drinks to order and use an organic ceremonial grade matcha.\n\nSmall comes with 3 pumps of cane sugar, large with 4 pumps of cane sugar. \nLet us know if you want it half sweet! ",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.90"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Cappuccino",
                            "description": "A timeless coffee favorite, our cappuccino features a harmonious blend of bold espresso, steamed milk, and a thick layer of velvety foam. Perfectly balanced and rich in flavor, this classic drink is a true delight for coffee lovers.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.33"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Chai Latte",
                            "description": "Experience the warmth and spice of our Chai Latte, made with a fragrant blend of black tea and aromatic spices like cinnamon, cardamom, and ginger. Combined with steamed milk and a touch of sweetness, this soothing drink offers a perfect balance of rich, creamy texture and exotic flavors.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.61"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "London Fog",
                            "description": "Step into the misty streets of London with our London Fog—a delightful blend of Earl Grey tea, steamed milk, and a hint of vanilla syrup. It&apos;s like a cozy embrace from Big Ben himself, offering a smooth, comforting experience with every sip. Let the fog lift your spirits and transport you to tea time bliss!",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.33"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Milk",
                            "description": "Experience the difference with Avalon Milk—crafted with care from local, pasture-raised cows. Rich, creamy, and packed with goodness, it’s the perfect choice for your favorite recipes or a simple, refreshing glass. Taste the tradition of quality in every sip! 🥛",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$3.74"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Mocha",
                            "description": "Made to order with real chocolate chips melted down... \n\nWarm up your senses with our Hot Mocha—a decadent dance of rich espresso and velvety chocolate, topped with a cloud of frothy milk and a sprinkle of cocoa magic. It&apos;s like a cozy cocoa hug on a chilly day, where every sip is a blissful moment of chocolatey delight. Indulge in the sweetness and let your taste buds celebrate!",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$8.34"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Latte",
                            "description": "Get cozy with our Latte, where a shot of espresso and silky steamed milk come together in a delightful dance of flavor and froth. It&apos;s like a warm hug in a cup, guaranteed to brighten your day with every creamy sip!",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.44"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Americano",
                            "description": "A classic and bold coffee drink made by blending rich espresso shots with hot water, creating a smooth, full-bodied flavor that’s perfect for coffee purists. Enjoy the deep, robust taste of our Americano, served piping hot.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$4.37"
                            },
                            "image": ""
                        }
                    ]
                },
                {
                    "name": "Cookies",
                    "hasMenuItem": [
                        {
                            "@type": "MenuItem",
                            "name": "Box of 4 Cookies ",
                            "description": "Choose 4 cookie flavours for your cookie box. ",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$26.40"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Box of 6 Cookies",
                            "description": "Choose 6 flavours for your cookie box. ",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$37.20"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Box of 10 Cookies",
                            "description": "Choose 10 cookie flavours to go inside your cookie box! ",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$57.00"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Box of 8 Cookies",
                            "description": "Choose 8 cookie flavours for your cookie box. ",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$46.80"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "OG",
                            "description": "Indulge in the very first cookie we ever created. Crafted with two types of premium dark chocolate, each bite offers a deep, rich cocoa experience that’s perfectly complemented by the satisfying crunch of toasted walnuts. To elevate the flavors even further, we’ve topped this cookie with a sprinkle of flaky sea salt, adding a touch of savory balance to the bittersweet chocolate and buttery walnuts. This cookie is an irresistible treat for those who crave a truly decadent dessert.\n\nIngredients: butter, brown sugar, white sugar, eggs, flour, baking soda, salt, cornstarch, walnuts, choco chunks, and choc wafers.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.61"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Gimme S&apos;mores",
                            "description": "Our best seller! The best part of camping, all in one cookie. The gimme s&apos;mores cookie has everyone dreaming of their favourite childhood memory of roasting marshmallows over the campfire and making the perfect s’mores. This cookie is with made with our signature cookie base and stuffed with marshmallows, dark chocolate chunks, and graham crackers for the perfect bite. Ingredients: brown sugar, all purpose flour, cake flour, butter, white sugar, cream cheese, eggs, graham crackers, marshmallows, dark chocolate chunks, baking soda, cornstarch, and salt.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.61"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "(V) Biscoff Cookie Butter",
                            "description": "Indulge in this decadent, plant-based treat crafted from a perfectly spiced cookie dough infused with crushed Lotus Biscoff cookies. Each bite unveils a rich, gooey center of creamy Biscoff cookie butter, creating a heavenly fusion of flavors. To top it all off, we’ve crowned this cookie with a signature Lotus Biscoff, adding an extra layer of crunch and caramelized sweetness. A true delight for Biscoff lovers and cookie connoisseurs alike!",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.90"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Birthday Cake",
                            "description": "It&apos;s always a celebration with this cookie. The birthday cake cookie is our take on the funfetti birthday cake flavour that everyone knows and loves. With hints of vanilla, lots of colorful sprinkles, and a bit of crunch from bite sized pieces of animal crackers, every bite has the perfect texture and flavour that anyone of all ages will enjoy. The birthday cake cookie is also perfectly for celebrations too! Just warm up the cookie following our heating instructions which you can find and put a candle in it! You can even put a scoop of vanilla ice cream next to it for the perfect dessert. Ingredients: brown sugar, all purpose flour, cake flour, butter, white sugar, cream cheese, eggs, animal crackers, vanilla extract, sprinkles, baking soda, cornstarch, and salt.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.61"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Chocolatey PB",
                            "description": "Peanut butter and chocolate, a match made in heaven. The chocolatey pb is the best of both worlds with our signature chocolate cookie dough base loaded with Reese’s peanut butter chips mixed in for peanut butter flavour throughout. For even more peanut butter goodness, we also stuff each cookie dough ball with a spoonful of peanut butter for an ooey-gooey center. This is one of our best selling cookies and we definitely recommend it if you’re a fan of peanut butter. Even NDP leader Jagmeet Singh is a huge fan of this cookie! Ingredients: all purpose flour, butter, cake flour, brown sugar, white sugar, eggs, peanut butter, peanut butter chips, cocoa powder, baking soda, corn starch, and salt.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.61"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Matcha Latte",
                            "description": "Savor the earthy elegance of our Matcha Dream Cookie, made with premium matcha powder that gives each bite a vibrant green hue and a distinct, delicate flavor. The soft, chewy texture is perfectly balanced by the subtle sweetness that lets the rich, grassy notes of matcha shine through. Finished with a drizzle of white chocolate, this cookie is a must-try for matcha lovers and anyone seeking a refined, flavorful treat.\n\nIngredients: butter, sugar, eggs, matcha, flour, baking soda, salt, cornstarch, and white choc chips.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.61"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Earl Grey and Honey",
                            "description": "Tea time, any time of the day. The earl grey honey cookie is back and now part of our permanent cookie menu! As it was supposed to be a monthly special for November 2020, with all the feedback and requests to bring it back, we’re happy to offer this customer favourite all year round! The earl grey honey cookie has twinning’s earl grey tea infused into the cookie dough and white chocolate chips mixed in for the perfect sweet and rich bite. Drizzled with a honey vanilla glaze on top, this cookie smells as good as it tastes! Ingredients: butter (cream), sugar, all-purpose flour, cake flour, egg, white chocolate chips (sugar, cocoa butter, whole milk powder, soy lecithin, natural vanilla flavour), earl grey tea, molasses, cornstarch, baking soda, honey, and salt.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.61"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Almond Croissant",
                            "description": "A decadent almond filled dough, stuffed with house-made frangipane, rolled in silced almonds, and baked to perfection. Topped with a dusting of icing sugar to indulge the tastebuds. Why choose between an almond croissont and a cookie, when you could have the best of both worlds?",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.61"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Peppermint Brownie",
                            "description": "A rich, fudgy brownie infused with refreshing peppermint and loaded with decadent chocolate chunks for a delightful contrast of flavors and textures.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.61"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Cookies &amp; Cream",
                            "description": "Milk&apos;s favourite cookie, in a cookie. The cookies n cream cookie has all of the best parts of the Oreo made even better with our signature cookie dough. With house-made Oreo wafers and white chocolate folded into the dough, we drizzle more white chocolate on top because the middle of the Oreo is definitely the best part. \n\nIngredients: brown sugar, all purpose flour, cake flour, butter, white sugar, cream cheese, eggs, cocoa powder, white chocolate wafers, milk, baking soda, cornstarch, and salt.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.61"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Caramel Macchiato",
                            "description": "Experience your favorite coffeehouse treat in cookie form! Our Caramel Macchiato Cookie is crafted with a rich espresso-infused dough, perfectly balanced with swirls of velvety caramel. Every bite delivers the bold flavor of freshly brewed coffee, complemented by sweet, buttery caramel notes. Finished with a drizzle of caramel on top, this cookie is the perfect pick-me-up for coffee lovers and anyone craving a sweet, caffeinated treat.\n\nNote: contains real coffee. \n\nIngredients: butter, sugar, eggs, coffee, flour, baking soda, salt, corn starch, and butter starch.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$6.61"
                            },
                            "image": ""
                        }
                    ]
                },
                {
                    "name": "Other",
                    "hasMenuItem": [
                        {
                            "@type": "MenuItem",
                            "name": "Bak&apos;d Baseball Cap",
                            "description": "Step up your style game with the Bak&apos;d unisex baseball cap! Perfect for any occasion, this cap features a sleek and modern design that suits everyone. Crafted from high-quality materials, it ensures durability and comfort, making it a must-have accessory for all your adventures. Features: Versatile design: unisex style that looks great on anyone. Premium quality: made from durable fabric to withstand daily wear and tear. Comfort fit: adjustable strap ensures a perfect fit for all head sizes. Breathable fabric: keeps you cool and comfortable, even on the hottest days. Perfect for: casual outings, sporting events, outdoor activities or everyday wear. Elevate your look with the Bak&apos;d unisex baseball cap – where comfort meets style!",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$36.00"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Coffee Bag",
                            "description": "Roast - espresso &amp; filter blend breakdown: 75% Brazil, Serra Negra natural. 25% Peru, Rony Lavan washed. Daily driver is our latest addition to our New Traditional line up. This blend is made up of a bold tasting natural Brazil from Minas Gerais and a washed coffee from Rony Lavan and the producers from Lima Coffee Coop. Look for bold flavours of dark chocolate with sweet and crisp cranberry notes. This coffee really shines as an espresso option.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$21.60"
                            },
                            "image": ""
                        }
                    ]
                }
            ]
        ]
    },
    "aggregateRating": {
        "@type": "AggregateRating",
        "ratingCount": 50,
        "worstRating": 1,
        "bestRating": 5,
        "reviewCount": 50,
        "ratingValue": 4.6
    },
    "servesCuisine": [
        "American",
        "Bakery"
    ],
    "url": "https://www.doordash.com/store/bak'd-cookies-new-westminster-30824397/?cursor=eyJzZWFyY2hfaXRlbV9jYXJvdXNlbF9jdXJzb3IiOnsicXVlcnkiOiJyZXN0YXVyYW50cyIsIml0ZW1faWRzIjpbXSwic2VhcmNoX3Rlcm0iOiJyZXN0YXVyYW50IiwidmVydGljYWxfaWQiOi05OSwidmVydGljYWxfbmFtZSI6IiJ9LCJzdG9yZV9wcmltYXJ5X3ZlcnRpY2FsX2lkcyI6WzEsNF19&pickup=false",
    "phone": "6045200741",
    "doordashOperationHourInfo": {
        "MONDAY": [
            "8 AM - 7:40 PM"
        ],
        "TUESDAY": [
            "8 AM - 7:40 PM"
        ],
        "WEDNESDAY": [
            "8 AM - 7:40 PM"
        ],
        "THURSDAY": [
            "8 AM - 7:40 PM"
        ],
        "FRIDAY": [
            "8 AM - 9:40 PM"
        ],
        "SATURDAY": [
            "10 AM - 9:40 PM"
        ],
        "SUNDAY": [
            "10 AM - 7:40 PM"
        ]
    },
    "storeOperationHourInfo": {
        "MONDAY": [
            "8 AM - 8 PM"
        ],
        "TUESDAY": [
            "8 AM - 8 PM"
        ],
        "WEDNESDAY": [
            "8 AM - 8 PM"
        ],
        "THURSDAY": [
            "8 AM - 8 PM"
        ],
        "FRIDAY": [
            "8 AM - 10 PM"
        ],
        "SATURDAY": [
            "10 AM - 10 PM"
        ],
        "SUNDAY": [
            "10 AM - 8 PM"
        ]
    },
    "merchant_cuisine": "Not found"
}