{
    "@context": "http://schema.org",
    "@type": "Restaurant",
    "image": [
        "https://img.cdn4dd.com/cdn-cgi/image/fit=contain,width=1200,height=672,format=auto/https://doordash-static.s3.amazonaws.com/media/restaurant/cover/JamesonHastingsChineseRestaurant_Vancouver_BC.png",
        "https://img.cdn4dd.com/cdn-cgi/image/fit=contain,width=1200,height=672,format=auto/https://doordash-static.s3.amazonaws.com/media/store/header/984c0119-696f-4cb7-9bbb-387538eca633.jpg"
    ],
    "name": "James on Hastings Chinese Restaurant 尖‘s 小厨",
    "address": "2683 E Hastings St, Vancouver, BC V5K 1Z5, Canada",
    "geo": {
        "@type": "GeoCoordinates",
        "latitude": "49.281418",
        "longitude": "-123.04991"
    },
    "priceRange": "$$",
    "hasMenu": {
        "@type": "Menu",
        "hasMenuSection": [
            [
                {
                    "name": "Most Ordered",
                    "hasMenuItem": [
                        {
                            "@type": "MenuItem",
                            "name": "3. Sesame Chicken with Peking Sweet-&amp;-Sour Sauce / 芝麻京都雞",
                            "description": "Sesame chicken with Peking sweet &amp; sour saucepot stickers (5 pcs).",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$28.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "212. Spareribs with Honey and Garlic / 蒜子蜜汁排骨\n",
                            "description": "Pork ribs should be the favorite dish of meat lovers. It&apos;s fun to eat, but it&apos;s quite a challenge to make. This honey-sauce pork rib is learned from YOYO. The method is very simple, almost in one go. I changed it a little myself and made it into a honey-flavored garlic bone.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$27.50"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "1. Wontons with Spicy Chilli and Garlic Sauce (8 Pcs.) / 紅油抄手",
                            "description": "One order comes with eight dumplings.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.05"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "5A. Ginger Crispy Beef / 薑汁牛柳絲",
                            "description": "Ginger crispy beef.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$28.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "169. Yang Chow Fried Rice / 揚州炒飯",
                            "description": "Yangzhou Fried Rice, also known as Yangzhou Egg Fried Rice, is a traditional famous dish in Yangzhou City, Jiangsu Province. Its main ingredients are rice, ham, eggs, shrimp, and so on. Yangzhou fried rice is rigorous in material selection, meticulous in production, exquisite in processing, and pays attention to color matching. After the frying is completed, the particles are clear, loose, soft, and hard, with harmonious colors, full luster, various ingredients, fresh and smooth, fragrant and delicious.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$28.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "209. Sweet-&amp;-Sour Pork with Pineapple / 菠蘿咕嚕肉",
                            "description": "Sweet and sour pork, also known as ancient meat. It is a famous dish of Guangdong. This dish started in the Qing Dynasty. Many foreigners in Guangzhou at that time liked to eat Chinese food very much, especially sweet and sour pork ribs, but they were not used to spitting bones. Cantonese chefs mix the boneless meat with seasoning and starch to make large meatballs, deep-fry them in oil until crispy, and stick with sweet and sour marinade. The taste is sweet and sour, which is very popular among Chinese and foreign guests. The history of sweet and sour pork ribs is relatively old. Foreigners often call &quot;ancient meat&quot; &quot;sweet and sweetmeat&quot; because it is elastic when eating and has a grating sound when chewing meat, so these two terms have coexisted for a long time. This dish enjoys a high reputation at home and abroad. The most common on the market is sweet and sour pork with canned pineapple.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$27.50"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "228. Beef with Broccoli / 百加利牛肉\n",
                            "description": "Cut beef into thin slices and rinse with water several times to remove blood. Mix the beef slices with cooking wine, 1 tablespoon soy sauce, 1/2 teaspoon salt, five-spice powder, and starch, and marinate for 30 minutes. Broccoli is broken into small florets, carrots are peeled and cut into diamond-shaped pieces for later use. Put water in a pot, bring to a boil over high heat, blanch the broccoli and carrot slices for 2 minutes and remove them.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$28.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "142. Singapore-Style Pan-Fried Vermicelli / 星洲炒米粉",
                            "description": "Spicy.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$28.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Combination Dinner for Two",
                            "description": "Two egg rolls, sweet-and-sour pork, beef with mixed vegetables, and chicken chow mein.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$48.40"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "136. Steamed Rice",
                            "description": "Steamed rice, available in bowl or bucket sizes.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$3.30"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "88. Deep-Fried Egg Rolls (3 Pcs.) / 炸春捲",
                            "description": "One order comes with three rolls.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$11.00"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "10. Teriyaki Chicken on BBQ Pork Fried Rice / 日式雞扒+叉燒炒飯",
                            "description": "Wash the chicken chops, drain and cut off the fat. Marinate with marinade for about 15 minutes. Heat oil in a wok and sauté onions until fragrant. Put some vegetable oil in a hot wok, fry the chicken chop with the skin side (if any) over medium heat until lightly browned, then fry the other side and turn to low heat. Pour the marinated chicken chop sauce into the wok, cover the wok, and cook over low heat until the chicken chop is cooked through.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$28.60"
                            },
                            "image": ""
                        }
                    ]
                },
                {
                    "name": "Specialty",
                    "hasMenuItem": [
                        {
                            "@type": "MenuItem",
                            "name": "242. Chili &amp; Green Beans with Minced Pork / 干煸四季豆",
                            "description": "Stir-fried green beans are a characteristic traditional dish belonging to Sichuan cuisine. The main ingredients are green beans, pork, red and dried peppers, etc. Stir-fried green beans taste dry, spicy, and refreshing, and you can drink them as an appetizer. It is simple to make, easy to use, rich in nutritional value, and is a home-cooked dish with all the colors and flavors.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$27.50"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "243. Braised Tofu with Vegetables / 紅燒豆腐",
                            "description": "Braised tofu is a classic and characteristic dish. Tofu, as a traditional and popular soy food in China, has been recorded in some ancient books. As a food with both food and medicine, tofu has many functions such as nourishing qi and tonifying deficiency. Modern nutrition has proved that tofu is an alkaline food, which is helpful for improving physical fitness. In the Five Dynasties, people called tofu &quot;little slaughtered sheep&quot;, and believed that the tenderness and nutritional value of tofu could be compared with that of mutton. Therefore, people have invented a variety of methods of braised tofu.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$27.50"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "246. Spicy Minced Pork with Tofu / 麻婆豆腐",
                            "description": "Mapo tofu (pinyin: má pó dòu fǔ; english: sauteed tofu in hot and spicy sauce ) is one of the traditional famous dishes in sichuan province, belonging to sichuan cuisine. Meat can also be used), the seasoning is watercress, chili noodles, pepper noodles, soy sauce, light soy sauce, dark soy sauce, sugar, starch, etc. the hemp comes from the pepper, and the spicy comes from the pepper noodles.This dish is numb, spicy, fresh, fragrant, hot, green, tender, and crispy, the characteristics of sichuan cuisine&apos;s spicy flavor are vividly displayed. Today, mapo tofu has traveled far and wide and settled in the united states, canada, the united kingdom, france, vietnam, singapore, malaysia, japan, australia, and other countries. Blindly home-cooked dishes jumped into the hall of elegance and became an internationally famous dish.On september 10, 2018, &quot;chinese cuisine&quot; was officially released, and &quot;mapo tofu&quot; was rated as one of the &quot;chinese cuisine&quot; top ten classic dishes in sichuan.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$28.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "247. Pan-Fried Choy Sum Vegetables with Ginger &amp; Greens / 薑蔥菜心苗",
                            "description": "First, use about 4 slices of ginger and cut into a puree, squeeze or twist out the ginger juice with a tea bag, heat up the oil in a wok, sauté the garlic, dry onion, and ginger slices, add the vegetable core, stir fry at least a little soft, add chicken powder or salt, stir-fry with a little sugar, cover and simmer for no more than 1 minute, then pour in ginger juice, sesame oil, and a little corn-starch water to bury the gravy, and it&apos;s done.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$27.50"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "248. Plain Vegetables / 清炒時菜",
                            "description": "Lunch, minimalist: stir-fried choy sum, choy sum, garlic slices, one green, and one white, simple and refreshing. Turn on the computer, play a tune that you like to listen to, and feel at ease. It seems that those times also exude a softly warm taste, which is comfortable.Cabbage is also known as rapeseed, vegetable moss, cantonese vegetables, cauliflower, etc. it is eaten with flower moss. The leaves and stems of cabbage are tender and delicious and can be grown all year round, but the cabbage from winter to early spring is the most tender and crispy. , is a kind of rapeseed. The cabbage heart is easy to grow. The tender and crispy cabbage heart have thick and green stems. The old cabbage heart has a white heart in the center of the stem, commonly known as raw bones. The fibrous stems of raw cabbage hearts are rough, difficult to chew, and difficult to digest.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$27.50"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "249. Pan-Fried Gai-Lan with Minced Garlic / 蒜蓉炒芥蘭",
                            "description": "A normal person&apos;s diet is inseparable from vegetarian food at every meal. If you refuse to eat vegetarian food, its nutritional intake will be out of balance. Because many substances come from vegetarian dishes, such as various vegetables, fungi, soy products, etc., which contain a large number of vitamins, dietary fiber, minerals, carbohydrates, and vegetable protein, as well as some beneficial health that the human body cannot synthesize by itself It must be ingested through vegetarian vegetables, so it is necessary to develop a diet with meat and vegetables.Today, I will make a traditional vegetarian dish &quot;fried kale with garlic&quot;, which is quick and easy to make. ",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$27.50"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "250. Fried Vegetables &amp; Chinese Mushrooms / 北菇扒菜膽",
                            "description": "Wash the shiitake mushrooms, soak them in cold water until soft, remove the stems, wash the small pond cabbage, and cut each one in half.Take half a bowl of water for soaking shiitake mushrooms, add a little sugar, salt, soy sauce and cooking wine to make a sauce. Heat the oil, sauté the minced garlic until fragrant, pour in the chopped cabbage and fry until it breaks, add a pinch of salt to taste and set out in a bowl.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$28.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "253. Seasonal Vegetables with Mushrooms / 鮑魚菇扒時蔬",
                            "description": "During the festivals, the &quot;cooking people&quot; who are in charge of the chef are always busy in circles. A feast is a great and vast project from buying ingredients, preparing ingredients, cooking to cleaning. It is a great and vast project. A simple, delicious side dish that is easy to eat. Among them, you can consider the dish of mushrooms and mushrooms, which is generous and decent.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$28.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "253A. Pan-Fried Pea Leave with Garlic Sauce / 蒜蓉豆苗",
                            "description": "The bean sprouts can be kept green when stir-fried on a hot fire, and they are also moist, tender, and garlic-flavored when eaten.\n\nStem picking takes longer, while stir-frying bean sprouts takes less than two minutes.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$29.70"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "244. Bean Sprouts with Shredded Meat / 芽菜炒三絲",
                            "description": "Eating too much meat makes us feel fat, especially you are a vegetarian, but the most ordinary and ordinary home-cooked dishes are the most appetizing.The bean sprouts are crisp and sweet, the chives have the effect of nourishing blood, the dried bean curd is rich in nutrients, and the vegetable juice is the essence. It can be used to make rice and swallow three bowls of rice.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$26.40"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "245. Plain Chop Suey / 炒雜碎",
                            "description": "Stir-fried bean sprouts, cabbage, and celery, typically includes a mix of vegetables in a light sauce.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$27.50"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "251. Salted Fish with Bean Sprouts / 鹹魚炒芽菜",
                            "description": "It has a lot of strong taste, and the color is very bright. At first, I didn’t know that silver sprouts are mung bean sprouts. To be honest, before coming to Singapore, I had never treated mung bean sprouts so delicately. I didn’t know that I had to remove both ends of the short mung bean sprouts. The child is a lot more upscale, and the picture of sitting with the family and picking bean sprouts will also be deeply frozen in memory.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$28.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "252. Dried Scallops on Pea Leaf / 瑤柱扒豆苗",
                            "description": "Scallop soaked in water overnight,minced garlic, chopped scallops,Fry the minced garlic with oil, add bean sprouts and stir well, set aside,Fry the scallops with oil, add sauce boil,Use cornstarch water to beat.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$33.00"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "241. Deep-Fried Tofu with Seafood / 瓊山玉子脆豆腐\n",
                            "description": "Qiongshan is a place name. In Hainan Province, there is a famous local dish called &quot;Qiongshan Tofu&quot;. A friend just happened to be in Hainan and was planning to open a restaurant. I asked how to make this dish authentic. People say it is tofu, but in fact, it has no tofu ingredients at all. It is steamed with egg whites. After steaming the &quot;tofu&quot;, the surface should be accompanied by fried side dishes. The side dishes can be freely chosen, which can be a few seasoned shrimps, or seafood and diced fruits. The key is to be salty. The most standard side dishes are scallops, chicken, and kale stalks, all diced and fried, beaten and seasoned.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$28.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "240. House Tofu Special / 荷塘一品豆腐",
                            "description": "Deep-fried tofu typically includes a mix of shrimp, chicken, and pork, sautéed with assorted vegetables in a special sauce.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$27.50"
                            },
                            "image": ""
                        }
                    ]
                },
                {
                    "name": "Signature Dishes",
                    "hasMenuItem": [
                        {
                            "@type": "MenuItem",
                            "name": "3. Sesame Chicken with Peking Sweet-&amp;-Sour Sauce / 芝麻京都雞",
                            "description": "Sesame chicken with Peking sweet &amp; sour saucepot stickers (5 pcs).",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$28.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "16. Peking Duck / 北京片皮鴨 (Two Courses)",
                            "description": "Two courses.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$88.00"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "5A. Ginger Crispy Beef / 薑汁牛柳絲",
                            "description": "Ginger crispy beef.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$28.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "5. Mongolian Crispy Beef / 蒙古牛柳絲",
                            "description": "Mongolian crispy beef.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$28.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "18A. Beef Lettuce Wrap / 牛鬆生菜包",
                            "description": "Beef lettuce wrap with your choice of chicken or pork.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$29.70"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "20. General Tao&apos;s Chicken / 左宗棠雞",
                            "description": "Zuo Zongtang&apos;s Chicken, also known as Zuo Rooster, is a famous dish in Hunan Province and belongs to Hunan cuisine. This dish was created by Peng Changgui in 1952 under the name Zuo Zongtang. In fact, it has no direct relationship with Zuo Zongtang, a general in the late Qing Dynasty. In 1952, the commander of the US Pacific Seventh Fleet, Redford, visited Taiwan. Liang Xuzhao, the commander-in-chief of the navy in Taiwan, hosted a banquet for three consecutive days and invited Peng Changgui to be the chef. Redford asked about the name of the dish after tasting it, and Peng Changgui casually named it &quot;General Tso&apos;s Chicken&quot;.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$28.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "7. Beef Strips with Black Pepper Sauce Chow Mein / 黑椒牛柳絲炒麵",
                            "description": "Cantonese Food Restaurant Vancouver.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$28.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "2. Pot Stickers (5 Pcs.) / 香煎餃子",
                            "description": "One order comes with five pieces.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$11.00"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "1. Wontons with Spicy Chilli and Garlic Sauce (8 Pcs.) / 紅油抄手",
                            "description": "One order comes with eight dumplings.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.05"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "8. Szechuan-Style Spicy Fried Rice / 四川炒飯",
                            "description": "Pork and ham.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$28.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "9. Teriyaki Chicken on Crispy Noodles / 日式雞扒炒麵",
                            "description": "Teriyaki chicken on crispy noodles.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$28.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "10. Teriyaki Chicken on BBQ Pork Fried Rice / 日式雞扒+叉燒炒飯",
                            "description": "Wash the chicken chops, drain and cut off the fat. Marinate with marinade for about 15 minutes. Heat oil in a wok and sauté onions until fragrant. Put some vegetable oil in a hot wok, fry the chicken chop with the skin side (if any) over medium heat until lightly browned, then fry the other side and turn to low heat. Pour the marinated chicken chop sauce into the wok, cover the wok, and cook over low heat until the chicken chop is cooked through.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$28.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "11. Sliced Barbeque Pork / 蜜味叉燒",
                            "description": "Char Siew is a traditional famous dish in Guangdong Province. It belongs to Cantonese cuisine. This dish is a kind of Cantonese roasted meat. This dish is to hang the marinated lean pork on a special fork and grill it in the oven. Good barbecued pork should be tender and juicy, bright in color, and full of fragrance. Among them, the balance of fat and lean meat is the best, which is called &quot;semi-fat and thin&quot;; other dishes made with barbecued pork include barbecued pork rice, barbecued pork buns, and barbecued pork crisps. Char Siew is a kind of Cantonese roast pork, which is cooked by putting pork on fire with a fork, hence the name. When grilling char siu, the surface is coated with red char siew sauce, so the char siew is red. &quot;Char Siu&quot; is developed from &quot;Plug Siu&quot;. Roasting is made by inserting the pork loin into the belly of the whole roasted pork and roasting it. Because the most delicious part of a roasted whole pig is the tenderloin. ",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$19.80"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "12. Quail (2 Pcs.) / 鵪鶉",
                            "description": "One order comes with two pieces.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "14. Crab Claw (1 Pc.) / 酥炸蟹拑",
                            "description": "One order comes with one piece.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$12.10"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "15. Barbeque Duck / 明爐燒鴨",
                            "description": "BBQ Roasted Duck is a delicacy that uses duck as the raw material and seasonings with white sugar, green onions, and salt. This dish is made by pouring the ingredients into a pot and stir-frying.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$35.20"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "17. Clam with Black Bean Sauce / 鼓汁炒蜆",
                            "description": "There are many types of shells. The clams used today belong to two petal-shaped shells, and there are many kinds of them. The local clams are mostly yellow sand clams. The British &quot;Clam Zhou Da Tang&quot; and the Italian &quot;Clam Fried Spaghetti&quot; are traditional, The representative of western food. Stir-fried clams with soy sauce and pepper sauce is a special stir-fry in Guangdong. Clams are regarded as colder shellfish by Cantonese people and are often served with ginger juice, wine, and pepper to remove the cold.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$29.70"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "4. Snail with Black Bean Sauce / 鼓汁紫蘇炒螺",
                            "description": "Fried snail with perilla is a traditional famous dish in Guangdong Province, belonging to Cantonese cuisine. The main ingredients are snails, perilla leaves, a little pepper, tea sauce, minced garlic, tempeh, etc. Stir-frying the snail with perilla leaves can not only remove the muddy smell of the snail itself but also bring out the umami of the snail. When you enter the mouth, you can taste a strange taste that is spicy and sweet.It is said that fried snails were first introduced to Guangzhou from Shunde, but people did not know how to use perilla leaves to cook snails at that time. Although they have tried to use chili, garlic, and tempeh as condiments for fried snails, they have never been able to remove the muddy smell of snails, which is really a fly in the ointment. Later, a farmer named Li Xiu in Pantang accidentally discovered that frying the snail with perilla leaves can remove the muddy smell of the snail itself, so this method spread quickly. Soon, people made improvements: before the snails were put into the pot, they were fished with oil, and then fried with basil leaves, which could bring out the umami of the snails. As a result, Huawei Fried Snail has gradually become a special food that Guangzhou people love.\n\n",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$33.00"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "6. Chicken Green Beans with Spicy Sauce / 魚香豆仔雞片\n",
                            "description": "Chicken green beans with spicy sauce.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$28.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "19. Mongolian Chicken / 蒙古雞絲",
                            "description": "Put 1 spoon of old soy sauce, 2 tablespoons of light soy sauce, 1 tablespoon of fish sauce, and 1 tablespoon of honey are poured into a bowl and mixed. Rinse the chicken thighs with water, dry the water with kitchen paper, pour the mixed sauce into the chicken thighs, massage it with your hands (you can poke it with a fork or a toothpick if you want to taste it), then put it in the refrigerator to marinate for half Hour. Ginger slices, green onions cut into long sections.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$28.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "21. Roasted Pigeon (1 Pc.) / 紅燒乳鴿",
                            "description": "*On Sale*  One order comes with one piece. ",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$25.30"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "18. Asparagus with Seafood in Black Bean Sauce / 牛鬆生菜包",
                            "description": "Tender asparagus and assorted seafood sautéed in a savory black bean sauce, garnished with mushrooms and carrots.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$30.80"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "13. Okra with Arctic Surf Clam in XO / XO醬秋葵北極貝\nSauce",
                            "description": "The common cooking methods for okra are stir-frying and mixing. I use okra with seafood ingredients and fresh scallops to make small stir-fry dishes, seasoning with hot and sour fresh dew to highlight the unique salty, fresh and clear fragrance of the finished dishes.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$29.70"
                            },
                            "image": ""
                        }
                    ]
                },
                {
                    "name": "Combination Dinners",
                    "hasMenuItem": [
                        {
                            "@type": "MenuItem",
                            "name": "Combination Dinner for Six",
                            "description": "Six egg rolls, honey garlic spareribs, sweet-and-sour chicken, beef with broccoli, special fried rice, chicken chow mein, and squid in rock salt and chili peppers.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$138.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Combination Dinner for Eight",
                            "description": "Eight egg rolls, squid in rock salt and chili peppers, lemon chicken, honey garlic spareribs, beef with green beans in black bean sauce, barbeque pork with broccoli, cod fillet with sweet-and-sour sauce, special fried rice, and chicken chow mein.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$190.30"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Combination Dinner for Two",
                            "description": "Two egg rolls, sweet-and-sour pork, beef with mixed vegetables, and chicken chow mein.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$48.40"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "Combination Dinner for Four",
                            "description": "Four egg rolls, beef with mixed vegetables, sweet-and-sour pork, barbeque pork fried rice, and chicken chow mein.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$89.10"
                            },
                            "image": ""
                        }
                    ]
                },
                {
                    "name": "Soups",
                    "hasMenuItem": [
                        {
                            "@type": "MenuItem",
                            "name": "175. Cream of Corn with Diced Chicken in Soup / 雞茸粟米羹",
                            "description": "The characteristics of chicken and corn soup: golden color, fragrant corn, smooth and glutinous soup, moderate freshness and sweetness, and rich in original flavor and nutrition. The taste is salty, fresh, and slightly sweet, delicious to drink, and easy to make.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$19.80"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "173. Hot-&amp;-Sour Soup / 酸辣湯",
                            "description": "Spicy.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$19.80"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "179a. Egg Drop Soup / 蘑菇蛋花湯",
                            "description": "Fresh oyster mushrooms 2, 3 taels, rinsed with water and torn into small strips; beat an egg and set aside. Heat the pot, add a small amount of oil, put the torn mushrooms into the pot, add a small amount of salt and fry for a minute or two. Add two or three rice bowls of water, boil it, taste the salt of the soup, if it is not enough, add it to the right amount. Pour the beaten eggs into the pot, wait for a while until the eggs are formed, stir well, add chopped green onion, add a little monosodium glutamate, and take out of the pot.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$19.80"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "176. Parsley with Minced Beef in Soup / 西湖牛肉羹\n",
                            "description": "West Lake beef soup (minced beef thick soup) is a traditional famous dish in Hangzhou City, Zhejiang Province. This dish is usually served in advance as a soup to moisten the throat and appetizers, and has been loved by ordinary people for 800 years. In the Southern Song Dynasty, the Beimin in Hangzhou used only a little minced meat, eggs, and mushrooms to make a cheap and high-quality soup according to local conditions, which became a substitute for the northern Hu spicy soup in memory. Therefore, the West Lake beef soup is very common among the people. Family dishes.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$22.00"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "178. Crab Meat with Fish Maw Soup / 蟹肉魚肚羹",
                            "description": "Stock ingredients: water for 1 old chicken; a whole piece of ham (using HAM is sweeter, but Jinhua ham is too oily and too salty), 1 large piece of pork is also ready for use; 8 scallops are soaked in warm water to soften Tear it into shreds, 1 large piece of ginger, cooking wine, boil water over high heat, put all the ingredients into a large clay pot, then turn to slow heat and simmer for 6 hours, then filter and serve as broth.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$33.00"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "174. Assorted Seafood &amp; Tofu in Soup / 海鮮豆腐羹",
                            "description": "Seafood tofu soup is a delicious home-cooked dish. The main ingredients are tofu, beef, tomatoes, mushrooms, green onions, fungus, bamboo shoots, beef soup, salt, monosodium glutamate, cooking wine, etc. Tofu is also good for post-illness, weight loss, and delicate skin.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$19.80"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "177. Chives with Dried Scallops in Soup / 韭皇瑤柱羹",
                            "description": "We have been preparing meals for everyone for several weeks. This year is the Lunar New Year, and in 3 days it will be the seventh day of the Lunar New Year. Of course, you have to eat well and celebrate your birthday and your family’s birthday! Of course, it is not enough to have food without soup, and children don’t like the choice of only soup. This time, James makes a very full-flavored soup, which is sure to be enjoyed by adults and children alike.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$22.00"
                            },
                            "image": ""
                        }
                    ]
                },
                {
                    "name": "Congee",
                    "hasMenuItem": [
                        {
                            "@type": "MenuItem",
                            "name": "36. Century Egg &amp; Lean Pork Congee / 皮蛋瘦肉粥",
                            "description": "Rice porridge combined with century egg and slices of lean pork, garnished with green onions.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "27. Sliced Fish Congee / 鮮魚片粥",
                            "description": "Fish fillet porridge, dishes, suitable for middle-aged and elderly people with weak spleen and stomach, lack of qi and blood, tiredness, lack of appetite, indigestion, etc.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "32. Sliced Fish &amp; Beef Congee  / 魚片牛肉粥",
                            "description": "Don&apos;t know what to eat for dinner or mid-night dinner, whether the weather is hot or cold, sliced fish and beef congee is the of the best chinese food you can&apos;t be missed. ",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "23. Famous Seafood Congee / 金牌海鮮粥",
                            "description": "Seafood porridge is one of the hong kong and taiwan cuisine recipes. It uses various fresh seafood such as rice and shrimp as the main ingredients. The cooking skills of seafood porridge are mainly cooking, and the taste is salty and fresh.The rice in seafood porridge has a high nutritional effect and is the basic food for supplementing nutrients; rice can provide rich b vitamins; it has the effect of clearing eyes and ears, stopping vexation, quenching thirst, and stopping diarrhea.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$18.70"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "28. Sliced Fish, Kidney, &amp; Liver Congee / 魚片腰肝粥",
                            "description": "This congee is nutritious and delicious. It is most suitable for the whole family to drink. Because the congee is delicious and the ingredients are delicious, if you think the above amount is not enough, you can increase it at will.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$18.70"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "33. House Special Congee / 三元及第粥",
                            "description": "Thick rice porridge featuring a special blend of ingredients, often including assorted meats and other savory additions.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "34. Chinese Mushroom &amp; Chicken Congee / 北菇滑雞粥",
                            "description": "Rice porridge combined with Chinese mushrooms and chicken, offering a traditional taste.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "35. Hong Kong-Style Congee / 荔灣艇仔粥",
                            "description": "Thick rice porridge with a variety of proteins and garnishments, often including seafood or pork, garnished with peanuts and scallions.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "37. Sliced Beef Congee / 生滾牛肉粥",
                            "description": "Chinese rice porridge with thinly sliced beef, often garnished with green onions and ginger for enhanced flavor.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "38. Kidney &amp; Liver Congee / 爽滑腰潤粥",
                            "description": "Chinese rice porridge featuring tender kidney and liver pieces, typically includes ginger and green onions.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "24. Prawn &amp; Scallop Congee / 蝦球帶子粥",
                            "description": "Wash the shrimp and remove the intestines; wash and slice the fresh scallops, marinate with a little taibai powder; disperse the miso with a little cold water and set it aside.Take a deep pot, add 6 cups of water and 3 cups of rice to boil, then boil the beaten miso for 15 minutes, add the shrimp and scallops from step 1, cook for another 5 minutes, add all the seasonings and mix evenly, put celery, shallots, coriander, chopped green onion before serving.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$18.70"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "31. Sliced Fish &amp; Lean Pork Congee / 魚片鹹瘦肉粥",
                            "description": "Fish fillet porridge lean meat porridge guangdong (canton) porridge is food with carp, pig exhibition, rice, and other main ingredients.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$18.70"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "39. Plain Congee / 明火白粥",
                            "description": "Plain congee, a rice porridge, offers a smooth and soothing texture, serving as a versatile base for additional ingredients.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$7.15"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "39a. Chinese Donut/ 油条",
                            "description": "Crispy and fluffy Chinese donut with a light airy texture. Perfectly paired with congee or soy milk for a tasty breakfast or snack.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$5.50"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "25. Prawn Congee / 鮮蝦球粥",
                            "description": "Wash the rice, soak it for half a day, pour it into a pressure cooker, put an appropriate amount of water, add a little salt and a few drops of olive oil to make a flavorful porridge base wash the fresh shrimp, remove the head and shell, remove the shrimp line, and cut along the back. The processed shrimp are marinated with a little salt, chicken essence, and a little cooking wine. Sprinkle a little cornstarch and stir well. Grab it with your hands until elastic.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$18.70"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "26. Prawn &amp; Sliced Fish Congee / 蝦球魚片粥",
                            "description": "Prawn and sliced fish congee combines tender prawns and delicate fish slices in a savory rice porridge, typically garnished with ginger and green onions.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$18.70"
                            },
                            "image": ""
                        }
                    ]
                },
                {
                    "name": "Noodle Soups",
                    "hasMenuItem": [
                        {
                            "@type": "MenuItem",
                            "name": "55. Wonton Soup / 鮮蝦淨雲吞",
                            "description": "Chinese wonton soup featuring shrimp-stuffed dumplings. Options include egg noodles, rice noodles, thick mein, vermicelli, Chinese spaghetti, yee mein, or instant noodles.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$16.50"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "73A. Wor Wonton",
                            "description": "Wor wonton soup with options of 6 or 12 wontons.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$18.70"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "53. Wonton Noodle Soup / 鮮蝦雲吞面",
                            "description": "Wonton Soup with shrimp wontons in a savory broth. Choose from egg noodles, rice noodles, or other noodle varieties listed.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$16.50"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "57. Wonton &amp; Dumpling Soup / 鮮蝦雲吞水餃",
                            "description": "Wonton &amp; Dumpling Soup: Delicate shrimp wontons and pork dumplings, choice of noodles including egg, rice, thick mein, vermicelli, Chinese spaghetti, yee mein, or instant.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "58. Wonton &amp; Dumpling Noodle Soup / 雲吞水餃麵",
                            "description": "Wonton and dumpling noodle soup with options ranging from egg noodles to vermicelli and instant noodles.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "61. Beef Brisket Noodle Soup / 柱侯牛腩麵",
                            "description": "Vancouver east cantonese noodle house. Put the strong noodles in the pot, add green vegetables and various seasonings, and finally pour a spoonful of carefully cooked special beef brisket, and a bowl of fragrant beef brisket noodles is ready. Although the method is simple, it is delicious and nutritious. Rich.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$16.50"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "54. Dumpling Noodle Soup / 鮮蝦水餃麵",
                            "description": "Dumpling Noodle Soup: Fresh shrimp dumplings in a savory broth. Choices of noodles include egg, rice, thick mein, vermicelli, Chinese spaghetti, yee mein, or instant noodles.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$16.50"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "56. Dumpling Soup / 鮮蝦淨水餃",
                            "description": "56. Dumpling Soup - Fresh shrimp dumplings with choice of egg noodles, rice noodles, thick mein, vermicelli, Chinese spaghetti, yee mein, or instant noodles in broth.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "59. Beef Ball Noodle Soup / 手打牛丸麵",
                            "description": "Beef brisket noodle soup. Beef tendon noodles soup. Beef brisket noodle broth. Curry beef brisket noodle soup. Beef, Ginger &amp; Green Onion Noodle Soup. Beef brisket noodles in clear soup is a simple home-cooked dish. The ingredients used are beef brisket, beef brisket, whole egg noodles, garlic, and parsley.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$16.50"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "60. Seaweed, Beef, &amp; Fish Ball Soup / 紫菜雙丸湯",
                            "description": "Seaweed, beef, &amp; fish ball soup with choice of egg noodles, rice noodles, vermicelli, or more.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "62. Beef Tendon Noodles Soup / 柱候牛筋麵",
                            "description": "Vancouver East Cantonese Noodle House. The column of Zhuhou beef tendon recommends the practice of Zhuhou beef tendon for you, sharing the tips on how to make Zhuhou beef tendon.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$16.50"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "63. Beef Brisket Noodle Broth / 清湯牛腩麵",
                            "description": "Vancouver east cantonese noodle house.Put the strong noodles in the pot, add green vegetables and various seasonings, and finally pour a spoonful of carefully cooked special beef brisket, and a bowl of fragrant beef brisket noodles is ready. Although the method is simple, it is delicious and nutritious. Rich.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$16.50"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "64. Curry Beef Brisket Noodle Soup / 咖哩牛腩麵",
                            "description": "Beef brisket (loin fossa): Beef is rich in protein, and its amino acid composition is closer to the needs of the human body than pork, which can improve the body&apos;s disease resistance. It is especially suitable for growth and development, postoperative and post-ill people to supplement blood loss and repair tissue. Eating beef in cold winter can warm the stomach, it is a good tonic for this season; beef has the effect of nourishing the middle and benefiting the qi, nourishing the spleen and stomach, strengthening the muscles and bones, reducing phlegm, and relieving wind, quenching thirst and saliva. People with weak muscles and bones, anemia, chronic illness, and yellow face and dazzling eyes.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$17.60"
                            },
                            "image": ""
                        },
                        {
                            "@type": "MenuItem",
                            "name": "66. Pork Ball Noodle Soup / 豬肉丸麵",
                            "description": "Pork ball soup with choice of noodles: egg, rice, thick mein, vermicelli, Chinese spaghetti, yee mein, or instant.",
                            "offers": {
                                "@type": "Offer",
                                "price": "CA$16.50"
                            },
                            "image": ""
                        }
                    ]
                }
            ]
        ]
    },
    "review": [
        {
            "@type": "Review",
            "publisher": "DoorDash",
            "author": {
                "@type": "Person",
                "name": "Lucia B"
            },
            "reviewRating": {
                "worstRating": 1,
                "bestRating": 5,
                "ratingValue": 4
            },
            "reviewBody": "I really enjoy the brisket! I wish the potatoes were just a bit more soft. overall delicious"
        },
        {
            "@type": "Review",
            "publisher": "DoorDash",
            "author": {
                "@type": "Person",
                "name": "Iain H"
            },
            "reviewRating": {
                "worstRating": 1,
                "bestRating": 5,
                "ratingValue": 1
            },
            "reviewBody": "Horribly overpriced. $20 for some plain egg noodles, a tiny amount of sauce in one corner, and some steamed vegetables with no sauce or seasoning. $10 for a single overcooked green onion pancake.\n\nComplete waste of money, would never order from again."
        },
        {
            "@type": "Review",
            "publisher": "DoorDash",
            "author": {
                "@type": "Person",
                "name": "Angela S"
            },
            "reviewRating": {
                "worstRating": 1,
                "bestRating": 5,
                "ratingValue": 5
            },
            "reviewBody": "Glad I found out about this spot because I will be ordering again whenever I&apos;m in the mood for Chinese food. Shrimp fried rice and egg rolls are bomb for the price and love how they don&apos;t forget the fortune cookie it&apos;s a cute bonus. "
        },
        {
            "@type": "Review",
            "publisher": "DoorDash",
            "author": {
                "@type": "Person",
                "name": "Shi Lin K"
            },
            "reviewRating": {
                "worstRating": 1,
                "bestRating": 5,
                "ratingValue": 5
            },
            "reviewBody": "They gave me a lot of fish in this order. More fish than curry in fact. The soup was fantastic. I will pair this with a drink next time!"
        },
        {
            "@type": "Review",
            "publisher": "DoorDash",
            "author": {
                "@type": "Person",
                "name": "Guilherme M"
            },
            "reviewRating": {
                "worstRating": 1,
                "bestRating": 5,
                "ratingValue": 3
            },
            "reviewBody": "Although very tasty, the price doesn&apos;t match what you get. I was expecting to get a lot more food for those prices,"
        }
    ],
    "aggregateRating": {
        "@type": "AggregateRating",
        "ratingCount": 50,
        "worstRating": 1,
        "bestRating": 5,
        "reviewCount": 50,
        "ratingValue": 4.4
    },
    "servesCuisine": [
        "Chinese",
        "Seafood",
        "Hot Pot",
        "Curry",
        "Spaghetti"
    ],
    "url": "https://www.doordash.com/store/james-on-hastings-chinese-restaurant-尖‘s-小厨-vancouver-42715/?cursor=eyJzZWFyY2hfaXRlbV9jYXJvdXNlbF9jdXJzb3IiOnsicXVlcnkiOiJyZXN0YXVyYW50cyIsIml0ZW1faWRzIjpbXSwic2VhcmNoX3Rlcm0iOiJyZXN0YXVyYW50IiwidmVydGljYWxfaWQiOi05OSwidmVydGljYWxfbmFtZSI6IiJ9LCJzdG9yZV9wcmltYXJ5X3ZlcnRpY2FsX2lkcyI6WzEsNF19&pickup=false",
    "phone": "+16042553188",
    "doordashOperationHourInfo": {
        "MONDAY": [
            "11 AM - 11:39 PM"
        ],
        "TUESDAY": [
            "11 AM - 11:39 PM"
        ],
        "WEDNESDAY": [
            "11 AM - 11:39 PM"
        ],
        "THURSDAY": [
            "11 AM - 11:39 PM"
        ],
        "FRIDAY": [
            "11 AM - 11:39 PM"
        ],
        "SATURDAY": [
            "11 AM - 11:39 PM"
        ],
        "SUNDAY": [
            "11 AM - 11:39 PM"
        ]
    },
    "storeOperationHourInfo": {
        "MONDAY": [
            "11 AM - 11:59 PM"
        ],
        "TUESDAY": [
            "11 AM - 11:59 PM"
        ],
        "WEDNESDAY": [
            "11 AM - 11:59 PM"
        ],
        "THURSDAY": [
            "11 AM - 11:59 PM"
        ],
        "FRIDAY": [
            "11 AM - 11:59 PM"
        ],
        "SATURDAY": [
            "11 AM - 11:59 PM"
        ],
        "SUNDAY": [
            "11 AM - 11:59 PM"
        ]
    },
    "merchant_cuisine": "Not found"
}